{
  "backend/main.mo": "Defines session, participant, and message types and provides logic for creating and joining chat sessions with random codes and limits.",
  "backend/migration.mo": "Contains data model definitions and a no-op migration function that returns the existing actor state.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides human-written summaries for major frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Defines global Tailwind layers and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the root React application and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component that restores or initializes session state and switches between LandingPage and ChatPage within the theme provider.",
  "frontend/src/components/actions/CopyCodeButton.tsx": "Button that copies a session code to the clipboard with fallback behavior and temporary success indicator.",
  "frontend/src/components/chat/AttachmentComposer.tsx": "Manages composing messages with file attachments or voice recordings, including previews, size checks, and send actions.",
  "frontend/src/components/chat/ParticipantList.tsx": "Displays participants with online state, typing indicators, and highlights the current user.",
  "frontend/src/components/chat/TypingDots.tsx": "Simple animated three-dot typing indicator component.",
  "frontend/src/components/feedback/InlineError.tsx": "Styled inline error component showing an alert icon and message.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Dropdown button for switching between light, dark, and system themes using useThemeMode.",
  "frontend/src/context/ThemeModeContext.tsx": "Provides theme mode and effective theme via context, syncing with storage and system settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity, login, clear, and status via context.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing.",
  "frontend/src/hooks/useSessionPolling.ts": "Polls session data and provides a sendMessage utility with attachment handling and immediate refetching.",
  "frontend/src/hooks/useThemeMode.ts": "Retrieves theme mode context and throws if used outside ThemeModeProvider.",
  "frontend/src/hooks/useTypingSignal.ts": "Sends throttled typing indicators through the backend actor and manages typing timeout.",
  "frontend/src/hooks/useVoiceRecorder.ts": "Implements voice recording with MediaRecorder, tracking duration, errors, and recorded audio blobs.",
  "frontend/src/index.css": "Tailwind base styles plus custom light/dark theme CSS variables and global utilities.",
  "frontend/src/lib/attachments.ts": "Helpers for file-to-Uint8 conversion, type checks, blob URL creation, and file size formatting.",
  "frontend/src/lib/backendErrorMessages.ts": "Maps backend error enums to user-friendly English error messages.",
  "frontend/src/lib/linkify.tsx": "Converts URLs in text into clickable links rendered as React nodes.",
  "frontend/src/lib/replicaReject.ts": "Detects replica rejection errors and returns user-friendly messages with optional request ID.",
  "frontend/src/lib/sessionStorage.ts": "Manages session and participant IDs in sessionStorage, providing create, retrieve, and clear helpers with error fallback.",
  "frontend/src/lib/themeMode.ts": "Stores and resolves theme mode preferences and listens for system theme changes using localStorage and matchMedia.",
  "frontend/src/lib/time.ts": "Formats bigint nanosecond timestamps into human-readable time or date-time strings.",
  "frontend/src/main.tsx": "Entry point mounting the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Implements the chat UI with message sending, attachments, join notifications, auto-scroll, and session polling.",
  "frontend/src/pages/LandingPage.tsx": "Handles create/join session flows with input validation, backend calls, error handling, and session persistence.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project metadata describing current state, features, issues, and rebuild context for the ZELLO chat app."
}