{
  "backend/main.mo": "Motoko backend defining sessions, participants, messages, and logic for creating/joining sessions with limits and typing/video call support.",
  "feature_evidence.json": "Feature evidence report describing a footer text update affecting LandingPage.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base style file defining OKLCH color tokens, light/dark mode variables, and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component that restores or sets session state and renders LandingPage or ChatPage accordingly.",
  "frontend/src/components/actions/CopyCodeButton.tsx": "Copy-to-clipboard button with fallback and visual feedback icons.",
  "frontend/src/components/chat/AttachmentComposer.tsx": "Chat input with file picker, image preview, size validation, typing signals, and send handling.",
  "frontend/src/components/chat/ParticipantList.tsx": "Renders participant list with typing indicators and highlights the current user.",
  "frontend/src/components/chat/TypingDots.tsx": "Animated three‑dot typing indicator component.",
  "frontend/src/components/feedback/InlineError.tsx": "Small reusable inline error box with icon and styled message.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor and invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder exporting nothing to allow custom query hooks elsewhere.",
  "frontend/src/hooks/useSessionPolling.ts": "Polls session data via react-query and exposes helpers for sending messages and updating video call URLs.",
  "frontend/src/hooks/useTypingSignal.ts": "Sends throttled typing indicators to the backend and manages typing timeout state.",
  "frontend/src/index.css": "Defines Tailwind layers and color variables for light and dark themes.",
  "frontend/src/lib/attachments.ts": "Utilities for file handling, including reading files, detecting images, creating blob URLs, and formatting sizes.",
  "frontend/src/lib/linkify.tsx": "Parses text for URLs and returns React nodes with clickable links.",
  "frontend/src/lib/sessionStorage.ts": "Handles storing, retrieving, and clearing session data and participant IDs in sessionStorage.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human-readable date or time strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChatPage.tsx": "Renders the chat interface, handling messaging, attachments, typing signals, scrolling, and video call URL updates.",
  "frontend/src/pages/LandingPage.tsx": "UI for creating or joining sessions, interacting with the backend and storing session details.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata defining app goals, existing features, known issues, and the current rebuild plan for a no-login web chat."
}