{
  "backend/main.mo": "Main actor implementing session creation, joining, messaging, typing indicators, attachments, and video call URL handling with in‑memory session map.",
  "backend/migration.mo": "Migration module converting old session/message structures to new ones with attachment support and video call URL field.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, features, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base and theme CSS defining OKLCH color tokens, dark mode variables, and global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component that restores or sets session state and switches between LandingPage and ChatPage.",
  "frontend/src/components/actions/CopyCodeButton.tsx": "Button that copies a session code to clipboard with fallback and visual confirmation.",
  "frontend/src/components/chat/AttachmentComposer.tsx": "Chat input component supporting text, file/image attachments, previews, size validation, and typing signals.",
  "frontend/src/components/chat/ParticipantList.tsx": "Displays chat participants with typing indicators, highlighting the current user and supporting a compact view.",
  "frontend/src/components/chat/TypingDots.tsx": "Renders animated bouncing dots used to indicate that a participant is typing.",
  "frontend/src/components/feedback/InlineError.tsx": "Shows an inline error message with an alert icon styled using Tailwind.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, indicating queries are handled by custom hooks.",
  "frontend/src/hooks/useSessionPolling.ts": "Polls session data, sends messages and attachments, and updates video call URLs through the backend actor.",
  "frontend/src/hooks/useTypingSignal.ts": "Sends throttled typing indicator updates to the backend and manages typing timeout behavior.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom vibrant color theme with light and dark mode variables.",
  "frontend/src/lib/attachments.ts": "Provides file utilities including conversion to Uint8Array, image checks, blob URL creation, and size formatting.",
  "frontend/src/lib/linkify.tsx": "Parses text and converts URLs into clickable links with styling.",
  "frontend/src/lib/sessionStorage.ts": "Manages session and participant ID persistence using sessionStorage with fallback generation.",
  "frontend/src/lib/time.ts": "Formats timestamps from nanoseconds into human-readable date or time strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatPage.tsx": "Main chat UI handling messaging, attachments, typing signals, video call URL management, and scroll behavior using session polling.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen for creating or joining sessions with input validation, session storage, and actor-based backend calls.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing chat app goals, existing features, known issues, and active fix request context."
}