{
  "kind": "build_request",
  "title": "Fix Create Session failing with replica reject/rejection error and improve error handling",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Fix the backend Create Session flow so it does not cause replica reject errors during normal use (e.g., when a user enters a valid display name and clicks “Create Session”), and ensure the backend returns a structured, user-safe error instead of trapping.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I'm not able to create a session when entered my name. Please check if there is any error because it is saying the replica return or reject rejection error request ID."
        ]
      },
      "acceptanceCriteria": [
        "Calling createSession with a non-empty participantId and non-empty displayName succeeds and returns a session code without the replica rejecting the request.",
        "Backend validation failures (empty displayName, empty participantId, failed code generation, session not found/full/etc.) do not use Runtime.trap; they return a structured error value that can be displayed in the UI.",
        "If cryptographic randomness fails (or is unavailable), session code generation still succeeds using a safe fallback approach, and the backend returns a normal error result only if a unique code cannot be produced after the configured attempts.",
        "The backend candid interface is updated consistently with the new structured response types so the frontend can call createSession without mismatched interface errors."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Update the frontend Landing Page Create Session UI to handle the backend’s structured createSession response and to display clear English error messages when the replica rejects a request (including preserving any request ID shown by the agent, when available).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "it is saying the replica return or reject rejection error request ID."
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns an error result for createSession, the Create Session card shows a friendly English error message (via the existing InlineError component) rather than a generic failure.",
        "When the network/agent returns a replica reject error, the UI displays an English message indicating the request was rejected and includes the request ID text if it is available from the thrown error.",
        "Successful createSession behavior remains unchanged: the landing page shows the “Code generated” state with the generated code and allows the user to click “Join Session” to enter the chat."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update any other frontend call sites that rely on backend methods changed in REQ-26 (e.g., joinSession/sendMessage/updateTypingIndicator/getSessionData if their return types are adjusted) so the app compiles and all session/chat flows continue to work end-to-end.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "The frontend TypeScript build passes with no type errors related to backend actor method signatures.",
        "Join session, sending messages (text/files/audio), typing indicators, and session polling continue to function correctly after the backend interface change.",
        "No user-facing text introduced by these updates is non-English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Only create backend/migration.mo if a state schema upgrade is required; otherwise avoid migrations.",
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new product features beyond fixing Create Session reliability and error reporting.",
    "Changing the visual theme or layout unrelated to the Create Session failure.",
    "Introducing external databases, third-party auth providers, or real-time websocket infrastructure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}